{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    " import os\n",
    " arr = os.listdir(\"notes\")\n",
    "import glob\n",
    "\n",
    "txtfiles = []\n",
    "for file in glob.glob(\"./notes/*.md\"):\n",
    "    txtfiles.append(file)\n",
    "    \n",
    "arr = [md.replace(\".md\", \"\")for md in txtfiles]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "arr_qid = []\n",
    "for item in arr:\n",
    "    if \"Q\" in item:\n",
    "        arr_qid.append(item)\n",
    "arr_qid = [md.replace(\"./notes/Q\", \"wd:Q\")for md in arr_qid]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "{ wd:Q47579749 wd:Q24678240 wd:Q31194033 wd:Q29617753 wd:Q101226729 wd:Q90591926 wd:Q27021885 wd:Q35830509 wd:Q42778383 wd:Q37301036 wd:Q62924270 wd:Q28254676 wd:Q74657187 wd:Q37629171 wd:Q42585641 wd:Q27010194 wd:Q28709067 wd:Q102232524 wd:Q26707522 wd:Q56880438 wd:Q96817154 wd:Q42776227 wd:Q52720499 wd:Q28595082 wd:Q100525924 wd:Q34169535 wd:Q2703462 wd:Q38798014 wd:Q37490532 wd:Q60017992 wd:Q98568691 wd:Q28974693 wd:Q100395427 wd:Q38622289 wd:Q57011346 wd:Q28181838 wd:Q30570244 wd:Q28842753 wd:Q58084012 wd:Q28292614 wd:Q28596617 wd:Q33037209 wd:Q57462271 wd:Q88605805 wd:Q90109096 wd:Q28200510 wd:Q29615252 wd:Q98665291 wd:Q98622035 wd:Q91997728 wd:Q104092178 wd:Q98568692 wd:Q34065481 wd:Q102926772 wd:Q33926910 wd:Q79763269 wd:Q57774232 wd:Q38432885 wd:Q96032351 wd:Q101473819 wd:Q103964322 wd:Q55483834 wd:Q21092566 wd:Q49483648 wd:Q78658697 wd:Q46221687 wd:Q102542608 wd:Q99564826 wd:Q64097544 wd:Q27311570 wd:Q34878068 wd:Q86694255 wd:Q34094294 wd:Q52374237 wd:Q42255083 wd:Q51427139 wd:Q59063943 wd:Q103811380 wd:Q24620160 wd:Q19671659 wd:Q43299861 wd:Q36854753 wd:Q104161380 wd:Q28250597 wd:Q40967362 wd:Q102929379 wd:Q28606409 wd:Q28185770 wd:Q89763874 wd:Q100526347 wd:Q103834013 wd:Q102205677 wd:Q34182035 wd:Q93086975 wd:Q21145382 wd:Q93086971 wd:Q21136172 wd:Q64962407 wd:Q93087299 wd:Q48373178 wd:Q100491078 wd:Q21092584 wd:Q54670808 wd:Q60137015 wd:Q48839876 wd:Q103034964 wd:Q91130546 wd:Q90588777 wd:Q50735370 wd:Q100500142 wd:Q28303099 wd:Q47317210 wd:Q64065346 wd:Q48094767 wd:Q60933812 wd:Q59058260 wd:Q46412887 wd:Q33928865 wd:Q57001498 wd:Q99234140 }\n"
     ]
    }
   ],
   "source": [
    "readings = \"{\"\n",
    "for i in arr_qid:\n",
    "    readings = readings + \" \" + i\n",
    "readings = readings + \" }\"\n",
    "\n",
    "print(readings)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_1 = \"\"\"\n",
    "\n",
    "#defaultView:Table\n",
    "SELECT\n",
    "  (MIN(?dates) AS ?date)\n",
    "  ?work ?workLabel\n",
    "  (GROUP_CONCAT(DISTINCT ?type_label; separator=\", \") AS ?type)\n",
    "  (SAMPLE(?pages_) AS ?pages)\n",
    "  ?venue ?venueLabel\n",
    "  (GROUP_CONCAT(DISTINCT ?author_label; separator=\", \") AS ?authors)\n",
    "WHERE {\n",
    "  VALUES ?work \"\"\" +  readings + \"\"\".\n",
    "  ?work wdt:P50 ?author .\n",
    "  OPTIONAL {\n",
    "    ?author rdfs:label ?author_label_ . FILTER (LANG(?author_label_) = 'en')\n",
    "  }\n",
    "  BIND(COALESCE(?author_label_, SUBSTR(STR(?author), 32)) AS ?author_label)\n",
    "  OPTIONAL { ?work wdt:P31 ?type_ . ?type_ rdfs:label ?type_label . FILTER (LANG(?type_label) = 'en') }\n",
    "  ?work wdt:P577 ?datetimes .\n",
    "  BIND(xsd:date(?datetimes) AS ?dates)\n",
    "  OPTIONAL { ?work wdt:P1104 ?pages_ }\n",
    "  OPTIONAL { ?work wdt:P1433 ?venue }\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,no,ru,sv,zh\". }  \n",
    "}\n",
    "GROUP BY ?work ?workLabel ?venue ?venueLabel\n",
    "ORDER BY DESC(?date)  \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "with open(\"sparql/articles.rq\", \"w+\") as f:\n",
    "  f.write(query_1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_2 = \"\"\"\n",
    "\n",
    "#defaultView:BubbleChart\n",
    "SELECT ?score ?topic ?topicLabel\n",
    "WITH {\n",
    "  SELECT\n",
    "    (SUM(?score_) AS ?score)\n",
    "    ?topic\n",
    "  WHERE {\n",
    "        {\n",
    "      SELECT (100 AS ?score_) ?topic WHERE {\n",
    "        VALUES ?work \"\"\" +  readings + \"\"\".\n",
    "         ?work  wdt:P921 ?topic . \n",
    "      }\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "      SELECT (1 AS ?score_) ?topic WHERE {\n",
    "        VALUES ?work \"\"\" +  readings + \"\"\".\n",
    "        ?citing_work wdt:P2860 ?work .\n",
    "        ?citing_work wdt:P921 ?topic . \n",
    "      }\n",
    "    }\n",
    "  }\n",
    "  GROUP BY ?topic\n",
    "} AS %results \n",
    "WHERE {\n",
    "  INCLUDE %results\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,da,de,es,jp,no,ru,sv,zh\". }\n",
    "}\n",
    "ORDER BY DESC(?score)\n",
    "LIMIT 50\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "with open(\"sparql/topic_bubble.rq\", \"w+\") as f:\n",
    "  f.write(query_2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_3 = \"\"\"\n",
    "\n",
    "\n",
    "#defaultView:Table\n",
    "SELECT ?count ?theme ?themeLabel ?example_work ?example_workLabel\n",
    "WITH {\n",
    "  SELECT (COUNT(?work) AS ?count) ?theme (SAMPLE(?work) AS ?example_work)\n",
    "  WHERE {\n",
    "    VALUES ?work \"\"\" +  readings + \"\"\".\n",
    "    ?work wdt:P921 ?theme .\n",
    "  }\n",
    "  GROUP BY ?theme\n",
    "} AS %result\n",
    "WHERE {\n",
    "  INCLUDE %result\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,ru,sv,zh\" . } \n",
    "}\n",
    "ORDER BY DESC(?count) \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "with open(\"sparql/topic_table.rq\", \"w+\") as f:\n",
    "  f.write(query_3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_4 = \"\"\"\n",
    "\n",
    "\n",
    "# Venue statistics for a collection\n",
    "SELECT\n",
    "  ?count (SAMPLE(?short_name_) AS ?short_name)\n",
    "  ?venue ?venueLabel\n",
    "  ?topics ?topicsUrl\n",
    "WITH {\n",
    "  SELECT\n",
    "    (COUNT(DISTINCT ?work) as ?count)\n",
    "    ?venue\n",
    "    (GROUP_CONCAT(DISTINCT ?topic_label; separator=\", \") AS ?topics)\n",
    "  WHERE {\n",
    "    VALUES ?work \"\"\" +  readings + \"\"\".\n",
    "    ?work wdt:P1433 ?venue .\n",
    "    OPTIONAL {\n",
    "      ?venue wdt:P921 ?topic .\n",
    "      ?topic rdfs:label ?topic_label . FILTER(LANG(?topic_label) = 'en') }\n",
    "  }\n",
    "  GROUP BY ?venue\n",
    "} AS %result\n",
    "WHERE {\n",
    "  INCLUDE %result\n",
    "  OPTIONAL { ?venue wdt:P1813 ?short_name_ . }\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,ru,sv,zh\". }  \n",
    "} \n",
    "GROUP BY ?count ?venue ?venueLabel ?topics ?topicsUrl\n",
    "ORDER BY DESC(?count)\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "with open(\"sparql/venues.rq\", \"w+\") as f:\n",
    "  f.write(query_4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_5 = \"\"\"\n",
    "\n",
    "\n",
    "#defaultView:Map\n",
    "SELECT ?organization ?organizationLabel ?geo ?count ?layer\n",
    "WITH {\n",
    "  SELECT DISTINCT ?organization ?geo (COUNT(DISTINCT ?work) AS ?count) WHERE {\n",
    "    VALUES ?work \"\"\" +  readings + \"\"\".\n",
    "        ?work wdt:P50 ?author .\n",
    "    ?author ( wdt:P108 | wdt:P463 | wdt:P1416 ) / wdt:P361* ?organization . \n",
    "    ?organization wdt:P625 ?geo .\n",
    "  }\n",
    "  GROUP BY ?organization ?geo ?count\n",
    "  ORDER BY DESC (?count)\n",
    "  LIMIT 2000\n",
    "} AS %organizations\n",
    "WHERE {\n",
    "  INCLUDE %organizations\n",
    "  BIND(IF( (?count < 1), \"No results\", IF((?count < 2), \"1 result\", IF((?count < 5), \"1 < results ≤ 10\", IF((?count < 101), \"10 < results ≤ 100\", IF((?count < 1001), \"100 < results ≤ 1000\", IF((?count < 10001), \"1000 < results ≤ 10000\", \"10000 or more results\") ) ) ) )) AS ?layer )\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }        \n",
    " }\n",
    "ORDER BY DESC (?count)\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "with open(\"sparql/author_map.rq\", \"w+\") as f:\n",
    "  f.write(query_5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_6 = \"\"\"\n",
    "\n",
    "\n",
    "#defaultView:Table\n",
    "SELECT\n",
    "  ?count\n",
    "  ?citing_author ?citing_authorLabel\n",
    "\n",
    "  # Either show the ORCID iD or construct part of a URL to search on the ORCID homepage\n",
    "  (COALESCE(?orcid_, CONCAT(\"orcid-search/quick-search/?searchQuery=\", ENCODE_FOR_URI(?citing_authorLabel))) AS ?orcid)\n",
    "WITH {\n",
    "  SELECT (COUNT(?citing_work) AS ?count) ?citing_author WHERE {\n",
    "    VALUES ?work \"\"\" +  readings + \"\"\".\n",
    "    ?citing_work wdt:P2860 ?work . \n",
    "    ?citing_work wdt:P50 ?citing_author .\n",
    "  }\n",
    "  GROUP BY ?citing_author \n",
    "  ORDER BY DESC(?count)\n",
    "  LIMIT 500\n",
    "} AS %counts\n",
    "WITH {\n",
    "  # An author might have multiple ORCID iDs\n",
    "  SELECT\n",
    "    ?count\n",
    "    ?citing_author\n",
    "    (SAMPLE(?orcids) AS ?orcid_)\n",
    "  WHERE {\n",
    "    INCLUDE %counts\n",
    "    OPTIONAL { ?citing_author wdt:P496 ?orcids }\n",
    "  }\n",
    "  GROUP BY ?count ?citing_author\n",
    "} AS %result\n",
    "WHERE {\n",
    "  INCLUDE %result\n",
    "  \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,ru,sv,zh\". }\n",
    "} \n",
    "ORDER BY DESC(?count)\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "with open(\"sparql/citing_authors.rq\", \"w+\") as f:\n",
    "  f.write(query_6)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_1 = \"\"\"#defaultView:Table\n",
    "SELECT\n",
    "  (MIN(?dates) AS ?date)\n",
    "  ?work ?workLabel\n",
    "  (GROUP_CONCAT(DISTINCT ?type_label; separator=\", \") AS ?type)\n",
    "  (SAMPLE(?pages_) AS ?pages)\n",
    "  ?venue ?venueLabel\n",
    "  (GROUP_CONCAT(DISTINCT ?author_label; separator=\", \") AS ?authors)\n",
    "WHERE {\n",
    "  VALUES ?work \"\"\" +  readings + \"\"\".\n",
    "  ?work wdt:P50 ?author .\n",
    "  OPTIONAL {\n",
    "    ?author rdfs:label ?author_label_ . FILTER (LANG(?author_label_) = 'en')\n",
    "  }\n",
    "  BIND(COALESCE(?author_label_, SUBSTR(STR(?author), 32)) AS ?author_label)\n",
    "  OPTIONAL { ?work wdt:P31 ?type_ . ?type_ rdfs:label ?type_label . FILTER (LANG(?type_label) = 'en') }\n",
    "  ?work wdt:P577 ?datetimes .\n",
    "  BIND(xsd:date(?datetimes) AS ?dates)\n",
    "  OPTIONAL { ?work wdt:P1104 ?pages_ }\n",
    "  OPTIONAL { ?work wdt:P1433 ?venue }\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,no,ru,sv,zh\". }  \n",
    "}\n",
    "GROUP BY ?work ?workLabel ?venue ?venueLabel\n",
    "ORDER BY DESC(?date)  \n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "https://query.wikidata.org/embed.html#%23defaultView%3ATable%0ASELECT%0A%20%20%28MIN%28%3Fdates%29%20AS%20%3Fdate%29%0A%20%20%3Fwork%20%3FworkLabel%0A%20%20%28GROUP_CONCAT%28DISTINCT%20%3Ftype_label%3B%20separator%3D%22%2C%20%22%29%20AS%20%3Ftype%29%0A%20%20%28SAMPLE%28%3Fpages_%29%20AS%20%3Fpages%29%0A%20%20%3Fvenue%20%3FvenueLabel%0A%20%20%28GROUP_CONCAT%28DISTINCT%20%3Fauthor_label%3B%20separator%3D%22%2C%20%22%29%20AS%20%3Fauthors%29%0AWHERE%20%7B%0A%20%20VALUES%20%3Fwork%20%7B%20wd%3AQ47579749%20wd%3AQ24678240%20wd%3AQ31194033%20wd%3AQ29617753%20wd%3AQ101226729%20wd%3AQ90591926%20wd%3AQ27021885%20wd%3AQ35830509%20wd%3AQ42778383%20wd%3AQ37301036%20wd%3AQ62924270%20wd%3AQ28254676%20wd%3AQ74657187%20wd%3AQ37629171%20wd%3AQ42585641%20wd%3AQ27010194%20wd%3AQ28709067%20wd%3AQ102232524%20wd%3AQ26707522%20wd%3AQ56880438%20wd%3AQ96817154%20wd%3AQ42776227%20wd%3AQ52720499%20wd%3AQ28595082%20wd%3AQ100525924%20wd%3AQ34169535%20wd%3AQ2703462%20wd%3AQ38798014%20wd%3AQ37490532%20wd%3AQ60017992%20wd%3AQ98568691%20wd%3AQ28974693%20wd%3AQ100395427%20wd%3AQ38622289%20wd%3AQ57011346%20wd%3AQ28181838%20wd%3AQ30570244%20wd%3AQ28842753%20wd%3AQ58084012%20wd%3AQ28292614%20wd%3AQ28596617%20wd%3AQ33037209%20wd%3AQ57462271%20wd%3AQ88605805%20wd%3AQ90109096%20wd%3AQ28200510%20wd%3AQ29615252%20wd%3AQ98665291%20wd%3AQ98622035%20wd%3AQ91997728%20wd%3AQ104092178%20wd%3AQ98568692%20wd%3AQ34065481%20wd%3AQ102926772%20wd%3AQ33926910%20wd%3AQ79763269%20wd%3AQ57774232%20wd%3AQ38432885%20wd%3AQ96032351%20wd%3AQ101473819%20wd%3AQ103964322%20wd%3AQ55483834%20wd%3AQ21092566%20wd%3AQ49483648%20wd%3AQ78658697%20wd%3AQ46221687%20wd%3AQ102542608%20wd%3AQ99564826%20wd%3AQ64097544%20wd%3AQ27311570%20wd%3AQ34878068%20wd%3AQ86694255%20wd%3AQ34094294%20wd%3AQ52374237%20wd%3AQ42255083%20wd%3AQ51427139%20wd%3AQ59063943%20wd%3AQ103811380%20wd%3AQ24620160%20wd%3AQ19671659%20wd%3AQ43299861%20wd%3AQ36854753%20wd%3AQ104161380%20wd%3AQ28250597%20wd%3AQ40967362%20wd%3AQ102929379%20wd%3AQ28606409%20wd%3AQ28185770%20wd%3AQ89763874%20wd%3AQ100526347%20wd%3AQ103834013%20wd%3AQ102205677%20wd%3AQ34182035%20wd%3AQ93086975%20wd%3AQ21145382%20wd%3AQ93086971%20wd%3AQ21136172%20wd%3AQ64962407%20wd%3AQ93087299%20wd%3AQ48373178%20wd%3AQ100491078%20wd%3AQ21092584%20wd%3AQ54670808%20wd%3AQ60137015%20wd%3AQ48839876%20wd%3AQ103034964%20wd%3AQ91130546%20wd%3AQ90588777%20wd%3AQ50735370%20wd%3AQ100500142%20wd%3AQ28303099%20wd%3AQ47317210%20wd%3AQ64065346%20wd%3AQ48094767%20wd%3AQ60933812%20wd%3AQ59058260%20wd%3AQ46412887%20wd%3AQ33928865%20wd%3AQ57001498%20wd%3AQ99234140%20%7D.%0A%20%20%3Fwork%20wdt%3AP50%20%3Fauthor%20.%0A%20%20OPTIONAL%20%7B%0A%20%20%20%20%3Fauthor%20rdfs%3Alabel%20%3Fauthor_label_%20.%20FILTER%20%28LANG%28%3Fauthor_label_%29%20%3D%20%27en%27%29%0A%20%20%7D%0A%20%20BIND%28COALESCE%28%3Fauthor_label_%2C%20SUBSTR%28STR%28%3Fauthor%29%2C%2032%29%29%20AS%20%3Fauthor_label%29%0A%20%20OPTIONAL%20%7B%20%3Fwork%20wdt%3AP31%20%3Ftype_%20.%20%3Ftype_%20rdfs%3Alabel%20%3Ftype_label%20.%20FILTER%20%28LANG%28%3Ftype_label%29%20%3D%20%27en%27%29%20%7D%0A%20%20%3Fwork%20wdt%3AP577%20%3Fdatetimes%20.%0A%20%20BIND%28xsd%3Adate%28%3Fdatetimes%29%20AS%20%3Fdates%29%0A%20%20OPTIONAL%20%7B%20%3Fwork%20wdt%3AP1104%20%3Fpages_%20%7D%0A%20%20OPTIONAL%20%7B%20%3Fwork%20wdt%3AP1433%20%3Fvenue%20%7D%0A%20%20SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22en%2Cda%2Cde%2Ces%2Cfr%2Cjp%2Cno%2Cru%2Csv%2Czh%22.%20%7D%20%20%0A%7D%0AGROUP%20BY%20%3Fwork%20%3FworkLabel%20%3Fvenue%20%3FvenueLabel%0AORDER%20BY%20DESC%28%3Fdate%29%20%20%0A%0A\n"
     ]
    }
   ],
   "source": [
    "import urllib \n",
    "test = \"https://query.wikidata.org/embed.html#\" + urllib.parse.quote(query_1, safe='')\n",
    "print(test)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "url1 = \"https://query.wikidata.org/embed.html#\" + urllib.parse.quote(query_1, safe='')\n",
    "url2 = \"https://query.wikidata.org/embed.html#\" + urllib.parse.quote(query_2, safe='')\n",
    "url3 = \"https://query.wikidata.org/embed.html#\" + urllib.parse.quote(query_3, safe='')\n",
    "url4 = \"https://query.wikidata.org/embed.html#\" + urllib.parse.quote(query_4, safe='')\n",
    "url5 = \"https://query.wikidata.org/embed.html#\" + urllib.parse.quote(query_5, safe='')\n",
    "url6 = \"https://query.wikidata.org/embed.html#\" + urllib.parse.quote(query_6, safe='')\n",
    "\n",
    "html = \"\"\"\n",
    "\n",
    "\n",
    "<!DOCTYPE html>\n",
    "<html>\n",
    "<head>\n",
    "\t<meta charset=\"utf-8\">\n",
    "\t<meta name=\"viewport\" content=\"width=device-width, initial-scale=1\">\n",
    "\t<title>Wikidata Bib - Tiago Lubiana</title>\n",
    "\t<meta property=\"og:description\" content=\"powered by Wikidata\">\n",
    "\t<link rel=\"stylesheet\" href=\"https://cdn.jsdelivr.net/npm/bulma@0.8.2/css/bulma.min.css\">\n",
    "\t<link rel=\"stylesheet\" href=\"https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css\">\n",
    "</head>\n",
    "\t<body>\n",
    "\t<section class=\"section\">\n",
    "    \t\t<div class=\"container\">\n",
    "\t\t\t<div class=\"columns is-centered\">\n",
    "\t\t\t\t<div class=\"column is-half has-text-centered\">\n",
    "      \t\t\t\t\t<h1 class=\"title is-1\"> My Readings</h1>\n",
    "    \t\t\t\t</div>\n",
    "\t\t\t</div>\n",
    "\t\t</div>\n",
    "\t\t<div class=\"column is-half has-text-centered\">\n",
    "  \t</section>\n",
    "\t<div class=\"container\">\n",
    "\t\t\t<div class=\"columns is-centered\">\n",
    "\t\t\t\t<div class=\"column is-half has-text-centered\">\n",
    "\t\t\t\t\t<h4 class=\"subtitle is-4\">\n",
    "       \t\t\t\t\tDashboard of Tiago Lubiana's Readings\n",
    "      \t\t\t\t\t</p>\n",
    "\t\t\t\t</div>\n",
    "\t\t\t</div>\n",
    "\t</div>\n",
    "\t</br>\n",
    "\t</br>\n",
    "\t<section class=\"section extra\">\n",
    "\t\t<div class=\"container\" id=\"query\">\n",
    "\t\t\t<div class=\"columns is-centered\">\n",
    "   \t\t\t\t <div class=\"tabs is-centered\">\n",
    "    \t\t\t\t\t<ul>\n",
    "      \t\t\t\t\t\t<li id=\"one-tab\" class=\"\">\n",
    "        \t\t\t\t\t\t\t<a onclick=\"switchToOne()\">\n",
    "      \t \t\t\t\t\t\t\t<span>Articles</span> \n",
    "      \t\t\t\t\t\t\t</a>\n",
    "      \t\t\t\t\t\t</li>\n",
    "      \t\t\t\t\t\t<li id=\"two-tab\">\n",
    "        \t\t\t\t\t\t\t<a onclick=\"switchToTwo()\">\n",
    "\t\t\t\t\t\t\t\t\t\t<span>Topic Bubble</span>\n",
    "      \t\t\t\t\t\t\t</a>\n",
    "                            </li>\n",
    "                            <li id=\"three-tab\">\n",
    "                                <a onclick=\"switchToThree()\">\n",
    "                                    <span>Topic Count</span>\n",
    "                              </a>\n",
    "                          </li>\n",
    "                          <li id=\"four-tab\">\n",
    "                            <a onclick=\"switchToFour()\">\n",
    "                                <span>Venues</span>\n",
    "                          </a>\n",
    "                      </li>\n",
    "                      <li id=\"five-tab\">\n",
    "                        <a onclick=\"switchToFive()\">\n",
    "                            <span>Author Map</span>\n",
    "                      </a>\n",
    "                      <li id=\"six-tab\">\n",
    "                        <a onclick=\"switchToSix()\">\n",
    "                            <span>Citing Authors</span>\n",
    "                      </a>\n",
    "                  </li>  \n",
    "    \t\t\t\t\t</ul>\n",
    "    \t\t\t\t\t<!--/tabs is-centered-->\n",
    "  \t\t\t\t</div>\n",
    " \t\t\t</div>\n",
    "\t\t</div>\n",
    "    </section>\n",
    "\t<div class=\"container\">\n",
    "    \t\t<div id=\"one-tab-content\">\n",
    "      \t\t\t<h5 class=\"title is-5\" style=\"text-align:center;\"> What I've been reading </h5>\n",
    "\t\t\t\t<div class=\"columns is-centered\"\n",
    "\t\t\t\t\t<p style=\"text-align: center\">\n",
    "\t\t\t\t\t\t<iframe width=92% height=\"500\" src=\"\"\" + '\"'+ url1 +'\"' + \"\"\"></iframe>\n",
    "\t\t\t\t\t</p>\n",
    "\t\t\t\t</div>\n",
    "    \t\t\t</div>\n",
    "    \t\t<div class=\"is-hidden\" id=\"two-tab-content\">\n",
    "      \t\t\t<<h5 class=\"title is-5\" style=\"text-align:center;\"> Topics I've been reading in bubbles </h5>\n",
    "\t\t\t\t<div class=\"columns is-centered\"\n",
    "\t\t\t\t\t<p style=\"text-align: center\">\n",
    "\t\t\t\t\t\t<iframe width=92% height=\"500\" src=\"\"\" + '\"'+ url2 +'\"' + \"\"\"></iframe>\n",
    "\t\t\t\t\t</p>\n",
    "\t\t\t\t</div>\n",
    "                </div>\n",
    "            <div class=\"is-hidden\" id=\"three-tab-content\">\n",
    "                    <<h5 class=\"title is-5\" style=\"text-align:center;\"> Topics I've been reading in a table </h5>\n",
    "                  <div class=\"columns is-centered\"\n",
    "                      <p style=\"text-align: center\">\n",
    "                        <iframe width=92% height=\"500\" src=\"\"\" + '\"'+ url3+'\"' + \"\"\"></iframe>\n",
    "                      </p>\n",
    "                  </div>\n",
    "                  </div>\n",
    "            <div class=\"is-hidden\" id=\"four-tab-content\">\n",
    "                    <<h5 class=\"title is-5\" style=\"text-align:center;\">  Which journals I've been reading</h5>\n",
    "                  <div class=\"columns is-centered\"\n",
    "                      <p style=\"text-align: center\">\n",
    "                        <iframe width=92% height=\"500\" src=\"\"\" + '\"'+ url4 +'\"' + \"\"\"></iframe>\n",
    "                      </p>\n",
    "                  </div>\n",
    "                  </div>\n",
    "            <div class=\"is-hidden\" id=\"five-tab-content\">\n",
    "                    <<h5 class=\"title is-5\" style=\"text-align:center;\"> Where are the authors I've been reading </h5>\n",
    "                  <div class=\"columns is-centered\"\n",
    "                      <p style=\"text-align: center\">\n",
    "                        <iframe width=92% height=\"500\" src=\"\"\" + '\"'+ url5 +'\"' + \"\"\"></iframe>\n",
    "                      </p>\n",
    "                  </div>\n",
    "                  </div>\n",
    "            <div class=\"is-hidden\" id=\"six-tab-content\">\n",
    "                    <<h5 class=\"title is-5\" style=\"text-align:center;\"> Who cites what I've been reading </h5>\n",
    "                  <div class=\"columns is-centered\"\n",
    "                      <p style=\"text-align: center\">\n",
    "                        <iframe width=92% height=\"500\" src=\"\"\" + '\"'+ url6 +'\"' + \"\"\"></iframe>\n",
    "                      </p>\n",
    "                  </div>\n",
    "                  </div>\n",
    "  \t</div>\n",
    "  <script src=\"https://ajax.googleapis.com/ajax/libs/jquery/3.2.1/jquery.min.js\"></script>\n",
    "  <script>\n",
    "\n",
    "    function switchToOne() {\n",
    "      removeActive();\n",
    "      hideAll();\n",
    "      $(\"#one-tab\").addClass(\"is-active\");\n",
    "      $(\"#one-tab-content\").removeClass(\"is-hidden\");\n",
    "    }\n",
    "\n",
    "    function switchToTwo() {\n",
    "      removeActive();\n",
    "      hideAll();\n",
    "      $(\"#two-tab\").addClass(\"is-active\");\n",
    "      $(\"#two-tab-content\").removeClass(\"is-hidden\");\n",
    "    }\n",
    "\n",
    "    function switchToThree() {\n",
    "      removeActive();\n",
    "      hideAll();\n",
    "      $(\"#three-tab\").addClass(\"is-active\");\n",
    "      $(\"#three-tab-content\").removeClass(\"is-hidden\");\n",
    "    }\n",
    "\n",
    "    function switchToFour() {\n",
    "      removeActive();\n",
    "      hideAll();\n",
    "      $(\"#four-tab\").addClass(\"is-active\");\n",
    "      $(\"#four-tab-content\").removeClass(\"is-hidden\");\n",
    "    }\n",
    "\n",
    "    function switchToFive() {\n",
    "      removeActive();\n",
    "      hideAll();\n",
    "      $(\"#five-tab\").addClass(\"is-active\");\n",
    "      $(\"#five-tab-content\").removeClass(\"is-hidden\");\n",
    "    }\n",
    "\n",
    "    function switchToSix() {\n",
    "      removeActive();\n",
    "      hideAll();\n",
    "      $(\"#six-tab\").addClass(\"is-active\");\n",
    "      $(\"#six-tab-content\").removeClass(\"is-hidden\");\n",
    "    }\n",
    "\n",
    "    function removeActive() {\n",
    "      $(\"li\").each(function() {\n",
    "        $(this).removeClass(\"is-active\");\n",
    "      });\n",
    "    }\n",
    "\n",
    "    function hideAll(){\n",
    "      $(\"#one-tab-content\").addClass(\"is-hidden\");\n",
    "      $(\"#two-tab-content\").addClass(\"is-hidden\");\n",
    "      $(\"#three-tab-content\").addClass(\"is-hidden\");\n",
    "      $(\"#four-tab-content\").addClass(\"is-hidden\");\n",
    "      $(\"#five-tab-content\").addClass(\"is-hidden\");\n",
    "      $(\"#six-tab-content\").addClass(\"is-hidden\");\n",
    "    }\n",
    "\t\n",
    "  </script>\n",
    "  </br>\n",
    "\n",
    "<footer class=\"footer\">\n",
    "  <div class=\"container\">\n",
    "    <div class=\"content has-text-centered\">\n",
    "      <p>\n",
    "        The content is licensed <a href=\"https://creativecommons.org/publicdomain/zero/1.0/\">under Creative Commons CC0</a>\n",
    "     \n",
    "        <p> Wikidata SPARQL Queries adapted from <a href=\"https://scholia.toolforge.org/\">Scholia</a>  </p>\n",
    "        <p> <strong>Dashboard</strong> adapted by <a href=\"https://www.wikidata.org/wiki/User:TiagoLubiana\">TiagoLubiana</a>\n",
    "\t  from the <a href=\"https://wikiproject-india.github.io/covid19dashboard/\">COVID-19 in India dashboard </a>\n",
    "      </p>\n",
    "    </div>\n",
    "  </div>\n",
    "</footer>\n",
    "</body>\n",
    "</html>\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "with open(\"docs/test.html\", \"w\") as f:\n",
    "    f.write(html)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6-final"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}